demonstracoes/delphi/Win32/Debug/Templates/vm60/PB/pedido_consultanf.soap

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:nfec="http://www.portalfiscal.inf.br/nfe/wsdl/NFeConsultaProtocolo4"><soap:Header/><soap:Body><nfec:nfeDadosMsg>%s</nfec:nfeDadosMsg></soap:Body></soap:Envelope>