backend/templates/nfeConsultaProtocolo4​.msg

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
   <soap:Header/>
   <soap:Body>
   	 <nfeDadosMsg xmlns="http://www.portalfiscal.inf.br/nfe/wsdl/NFeConsultaProtocolo4"><consSitNFe versao="4.00" xmlns="http://www.portalfiscal.inf.br/nfe"><tpAmb>$tpAmb</tpAmb><xServ>CONSULTAR</xServ><chNFe>$chNFe</chNFe></consSitNFe></nfeDadosMsg>
   </soap:Body>
</soap:Envelope>